<?xml version="1.0"?>
<rss xmlns:iweb="http://www.apple.com/iweb" version="2.0">
  <channel>
    <title>Blog</title>
    <link>http://solonaguiar.com/Solons_homepage/Blog</link>
    <description>Esse blog guarda um pouco das minhas vis&#xF5;es e sentimentos sobre a vida, os relacionamentos, os estudos, o trabalho, as viagens. Enfim, tudo aquilo que me rodeia.

Welcome to my blog. I&#x2019;ll talk about everything I experience. </description>
    <item>
      <title>Post #4</title>
      <link>http://solonaguiar.com/Solons_homepage/Blog/Entradas/2012/8/22_Post_4.html</link>
      <guid isPermaLink="false">fc18f74a-a77d-4800-8671-e5539c94d533</guid>
      <pubDate>Wed, 22 Aug 2012 20:42:31 -0300</pubDate>
      <description>Whenever starting a new project, a whole bunch of new stuff has to be created and prepared. That is true both for big and the small projects. Bootstrapping something from the scratch takes a lot of effort, because many details have to be considered (how is the communication going to be, what&#x2019;s the team philosophy etc.), tough decisions have to be made (which technologies to use, what design of solution to use etc.) and tools have to be configured (databases, repositories, machines, servers, environments etc.).&lt;br/&gt;&lt;br/&gt;The good thing being in a project during this period of time is that you can get a clear picture from the scratch of how things are organized, who depends on what and etc. Also, you participate on the decision-making process that will affect almost the whole lifetime of the project (this might also happen in the future, but usually it does in a smaller scale). The bad thing is that it might take away some of your hair during the process. &lt;br/&gt;&lt;br/&gt;On the other hand, when you dive in into an on going project a lot of decisions have already been made. So now it&#x2019;s up to you take some extra effort to understand how things are organized, who depends on whom, what&#x2019;s the responsibility of each tool, how they are configured etc. &lt;br/&gt;&lt;br/&gt;This step may be a bit painful, but if you&#x2019;re on a really cool project where people care about the future, you should have some kind of guide to follow at least to have your environment set (bootstrap scripts, follow up guide etc.). I think it&#x2019;s a good idea to do it on your own. That way, you can at least get your hands dirty doing some low level configuration. It will help you understand how things are supposed to fit together or at least how they are configured!&lt;br/&gt;&lt;br/&gt;During my short career I had the chance to be on both situations more than a couple of times (that&#x2019;s why I believe I have so much authority to talk about it). From my experience, I&#x2019;d say that the second one is harder to be in both because some stuff might be new to you (when you&#x2019;re starting a project and taking decisions usually you take decisions on what you already know how to work with it or heard of) or because the project and/or going for a long time. But none it&#x2019;s not impossible. It does require more effort, but when you start getting things on your mind it becomes so much fulfilling and enlightening. &lt;br/&gt;&lt;br/&gt;My message in this is: as much as things might sound hard at first, put your mind into it. Dive deeply and work as hard as you can and you will be able to overcome the difficulties and really learn some cool stuff. Some time later, the reward will be so good, that you will look for more!&lt;br/&gt;</description>
      <iweb:comment enabled="0" count="0" link="http://solonaguiar.com/Solons_homepage/Blog/Entradas/2012/8/22_Post_4.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Post #3</title>
      <link>http://solonaguiar.com/Solons_homepage/Blog/Entradas/2012/8/19_Post_3.html</link>
      <guid isPermaLink="false">511acd09-3610-419b-b27c-e8db6c34271c</guid>
      <pubDate>Sun, 19 Aug 2012 22:35:22 -0300</pubDate>
      <description>In few words, I think the three main things one needs to at least reconize are the Activities, Services and Intents. &lt;br/&gt;&lt;br/&gt;Activities are directly related to the user interface. They map the UI [created separately as a .xml file] and what the user can do. Usually they hold the context of the application and provide access to lot of built-in android functionalities/classes. Services, on the other hand, are not related to user interface. They usually run in the background of the application doing some important work that the user might not be aware of. For instance, in some application you might want to keep sending emails on the background, while not needing the UI to be up on the screen (letting the user use the phone for something else). This can be accomplished with Services. Last, but not least, there are the Intents. Intents are some sort of requests that the developer might make either to the OS or to other applications/services. That makes it possible, for example, for a call to a built-in android activity [such as displaying the user contacts or email screen] or another app to start the email service. There are a lot of different intent types on the android platform and/or the developer might also create his/her own. &lt;br/&gt;&lt;br/&gt;While developing Android applications other especial details must be taken care of. The first one is deciding what API level(s) to support. That&#x2019;s a MUST question that has to be answered in the early days of the project (I&#x2019;d say in the first day!), because it will impact directly on what tool the developers will have to create and test de application (the interfaces vary from level to level and different set of emulators exist for each API). Of course it&#x2019;s also a business and client decision, but everyone should be involved, because has a direct impact on the product.&lt;br/&gt;&lt;br/&gt;Another important point is the AndroidManifest file. It describers the application to the operating system (its also used by the Play Store to check compatibility). It is where, for example, the developer specifies the minimum API level the application requires, the set of permissions it needs from the user (such as sending SMSs, accessing the network state, read phone contacts etc.), declares the set services provided by the application and the main activity (the one used to start the app).&lt;br/&gt;&lt;br/&gt;Android is a really cool technology. It was my first experience with mobile development. It was a good challenge that I enjoyed facing. I hope I can work with it again. Also, another experience with other(s) type of mobile technology would be awesome, so I could have a chance to compare the strengths and weaknesses of each one of them.  </description>
      <iweb:comment enabled="0" count="0" link="http://solonaguiar.com/Solons_homepage/Blog/Entradas/2012/8/19_Post_3.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Postagem #3</title>
      <link>http://solonaguiar.com/Solons_homepage/Blog/Entradas/2011/7/30_Postagem_3.html</link>
      <guid isPermaLink="false">e425a778-d0b6-4d25-a611-ec2932256bf2</guid>
      <pubDate>Sat, 30 Jul 2011 11:55:43 -0300</pubDate>
      <description>Recentemente tive que trabalhar com Java Swing em uma aplica&#xE7;&#xE3;o que estava desenvolvendo. Eu j&#xE1; era familiarizado com essa tecnologia (at&#xE9; j&#xE1; dei uma aula sobre ela para o pessoal de Programa&#xE7;&#xE3;o 2 - embora n&#xE3;o tenha achado os slides). Entretanto, n&#xE3;o tinha trabalhado ainda com design de interfaces t&#xE3;o rico quanto o que precisei.&lt;br/&gt;&lt;br/&gt;O que t&#xED;nhamos em mente era algo para montar uma matriz que mostrasse as informa&#xE7;&#xF5;es de certas medidas. Uma coisa legal levantada foi usar uma s&#xE9;rie de medidores para mostrar essas medidas. &#xC0; primeira vista, obviamente, se pensa em implementar esses componentes na m&#xE3;o. Essa tarefa n&#xE3;o escalaria devido ao deadline que t&#xED;nhamos aproximando. A outra alternativa seria utilizar uma biblioteca j&#xE1; existente. Ap&#xF3;s algumas buscas e testes, decidimos utilizar a &lt;a href="http://harmoniccode.blogspot.com/"&gt;Steel Series&lt;/a&gt;. &#xC9; uma biblioteca muito legal que traz consigo uma gama de funcionalidades e op&#xE7;&#xF5;es de gadgets. Eles, inclusive, montaram demos muito legais (&lt;a href="http://idisk.mac.com/han.solo-Public/SteelSeries/test.jnlp"&gt;aqui&lt;/a&gt; e &lt;a href="http://idisk.mac.com/han.solo-Public/SteelSeries/testextras.jnlp"&gt;aqui&lt;/a&gt;). &lt;br/&gt;&lt;br/&gt;Trabalhar com a biblioteca n&#xE3;o foi complicado. Apesar de identificarmos alguns problemas menores em casos espec&#xED;ficos, ela funcionou conforme esperado. O mais interessante &#xE9; que ela foi tamb&#xE9;m implementada em Java Swing. Muito legal ver como o cara usou a tecnologia que ele conhecia para criar algo legal. No fim das contas, acredito que fizemos o que precis&#xE1;vamos (depois, &#xE9; claro, de apanhar um pouco).&lt;br/&gt;&lt;br/&gt;Fica a dica de biblioteca muito legal. &#xD3;timo trabalho.</description>
      <iweb:comment enabled="0" count="0" link="http://solonaguiar.com/Solons_homepage/Blog/Entradas/2011/7/30_Postagem_3.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Postagem #2</title>
      <link>http://solonaguiar.com/Solons_homepage/Blog/Entradas/2011/1/4_Postagem_2.html</link>
      <guid isPermaLink="false">1c0a132d-22df-4cb4-bdf3-e10e94501aa1</guid>
      <pubDate>Tue, 4 Jan 2011 22:12:43 -0200</pubDate>
      <description>&#xC9; bem verdade que passei algum tempo sem escrever aqui no blog. Parte disso ocorre por pregui&#xE7;a minha e outra parte porque eu estive off esses dias. E pretendo fic&#xE1;-lo sim durante as minhas f&#xE9;rias. Afinal de contas, qual o prop&#xF3;sito de ficar aqui se e tenho as f&#xE9;rias para aproveitar.&lt;br/&gt;E &#xE9; justamente esse o tema da minha escrita hoje. Pretendo conversar sobre planos para as f&#xE9;rias.&lt;br/&gt;&lt;br/&gt;Se voc&#xEA; est&#xE1; lendo isso, &#xE9; bem prov&#xE1;vel que esteja sem fazer nada. Afinal de contas, porque estaria lendo justamente o meu blog durante o ver&#xE3;o. Saia desse computador. V&#xE1; fazer algo. Leia um livro; pratique um esporte; aprenda algo novo; explore o que h&#xE1; a sua volta.&lt;br/&gt;&lt;br/&gt;O mais f&#xE1;cil e natural para a maioria das pessoas &#xE9; ficar parado. Esperar o tempo e a vida passar. Isso &#xE9; o mais c&#xF4;modo; o mais f&#xE1;cil; aquilo que exige menos. N&#xE3;o posso dizer que &#xE9; o errado, porque vai do ponto de vista de cada um. Mas, para mim, n&#xE3;o &#xE9; o que eu quero.&lt;br/&gt;&lt;br/&gt;Acredito que ao nascermos n&#xF3;s ganhamos um corpo. Podemos usar dele da maneira que bem desejamos. Mas, se voc&#xEA; pensar bem, voc&#xEA; paga por aquilo que faz. Para pela forma que voc&#xEA; trata esse presente recebido. Se voc&#xEA; senta e fica s&#xF3; vendo a vida passar e se empanturrando de besteiras, pode ser que n&#xE3;o agora, mas depois, voc&#xEA; pague por isso. N&#xE3;o que eu o deseje, mas &#xE9; o que acontece. Sempre pagamos por tudo aquilo que fazemos. &#xC9; preciso aprender com isso. Aprender com os erros.&lt;br/&gt;&lt;br/&gt;Eu estou de f&#xE9;rias. Ainda n&#xE3;o fiz muita coisa de atividade nessas f&#xE9;rias. Mas estou procurando adequar meu dia-a-dia. J&#xE1; joguei t&#xEA;nis. Fui caminhar uma vez no Ibirapuera (estava sem meus t&#xEA;nis de corrida). Pretendo fazer mais coisas ainda... Mas isso n&#xE3;o vem ao caso agora. O que eu queria passar &#xE9; isso: Aproveite o que voc&#xEA; tem. Aproveite o agora (que voc&#xEA;, provavelmente, ainda pode usar os joelhos). N&#xE3;o deixe para amanh&#xE3;. Viva a vida a cada minuto da melhor maneira. &lt;br/&gt;&lt;br/&gt;:)</description>
      <iweb:comment enabled="0" count="0" link="http://solonaguiar.com/Solons_homepage/Blog/Entradas/2011/1/4_Postagem_2.html#comment_layer"></iweb:comment>
    </item>
    <item>
      <title>Postagem #1</title>
      <link>http://solonaguiar.com/Solons_homepage/Blog/Entradas/2010/12/3_Postagem_1.html</link>
      <guid isPermaLink="false">f26ba1b2-775a-4011-af7e-0d3474049f80</guid>
      <pubDate>Fri, 3 Dec 2010 23:50:54 -0200</pubDate>
      <description>Essa postagem &#xE9; s&#xF3; para inaugurar o blog e o meu site. Espero que algu&#xE9;m, algum dia, possa ler essas coisas que eu escrevo e quem sabe, inclusive, tecer alguma opini&#xE3;o sobre. &#xC9; pedir demais?</description>
      <iweb:comment enabled="0" count="0" link="http://solonaguiar.com/Solons_homepage/Blog/Entradas/2010/12/3_Postagem_1.html#comment_layer"></iweb:comment>
    </item>
    <iweb:dateFormat>EEEE, d 'de' MMMM 'de' yyyy</iweb:dateFormat>
    <iweb:baseURL>http://solonaguiar.com/Solons_homepage/Blog</iweb:baseURL>
    <iweb:maximumSummaryItems>5</iweb:maximumSummaryItems>
  </channel>
</rss>
