<?xml version="1.0"?>
<content collectionGUID="069C93EB-8A87-4F9D-AFFB-07BD4D352B1D">
  <lastEdited clientType="local-build-20130217" date="2013-02-17 21:24:16 -0300"/>
  <textBox id="generic-header-attribute" dynamic="no" visible="yes">
    <richText>Postagem #2</richText>
  </textBox>
  <textBox id="generic-title-attributes" dynamic="no" visible="yes">
    <richText>Postagem #2</richText>
  </textBox>
  <textBox id="generic-datefield-attributes" dynamic="no" visible="yes">
    <richText>ter&#xE7;a-feira, 4 de janeiro de 2011</richText>
  </textBox>
  <textBox id="generic-body-attributes" dynamic="no" visible="yes">
    <richText>&#xC9; bem verdade que passei algum tempo sem escrever aqui no blog. Parte disso ocorre por pregui&#xE7;a minha e outra parte porque eu estive off esses dias. E pretendo fic&#xE1;-lo sim durante as minhas f&#xE9;rias. Afinal de contas, qual o prop&#xF3;sito de ficar aqui se e tenho as f&#xE9;rias para aproveitar.&#xD;E &#xE9; justamente esse o tema da minha escrita hoje. Pretendo conversar sobre planos para as f&#xE9;rias.&#xD;&#xD;Se voc&#xEA; est&#xE1; lendo isso, &#xE9; bem prov&#xE1;vel que esteja sem fazer nada. Afinal de contas, porque estaria lendo justamente o meu blog durante o ver&#xE3;o. Saia desse computador. V&#xE1; fazer algo. Leia um livro; pratique um esporte; aprenda algo novo; explore o que h&#xE1; a sua volta.&#xD;&#xD;O mais f&#xE1;cil e natural para a maioria das pessoas &#xE9; ficar parado. Esperar o tempo e a vida passar. Isso &#xE9; o mais c&#xF4;modo; o mais f&#xE1;cil; aquilo que exige menos. N&#xE3;o posso dizer que &#xE9; o errado, porque vai do ponto de vista de cada um. Mas, para mim, n&#xE3;o &#xE9; o que eu quero.&#xD;&#xD;Acredito que ao nascermos n&#xF3;s ganhamos um corpo. Podemos usar dele da maneira que bem desejamos. Mas, se voc&#xEA; pensar bem, voc&#xEA; paga por aquilo que faz. Para pela forma que voc&#xEA; trata esse presente recebido. Se voc&#xEA; senta e fica s&#xF3; vendo a vida passar e se empanturrando de besteiras, pode ser que n&#xE3;o agora, mas depois, voc&#xEA; pague por isso. N&#xE3;o que eu o deseje, mas &#xE9; o que acontece. Sempre pagamos por tudo aquilo que fazemos. &#xC9; preciso aprender com isso. Aprender com os erros.&#xD;&#xD;Eu estou de f&#xE9;rias. Ainda n&#xE3;o fiz muita coisa de atividade nessas f&#xE9;rias. Mas estou procurando adequar meu dia-a-dia. J&#xE1; joguei t&#xEA;nis. Fui caminhar uma vez no Ibirapuera (estava sem meus t&#xEA;nis de corrida). Pretendo fazer mais coisas ainda... Mas isso n&#xE3;o vem ao caso agora. O que eu queria passar &#xE9; isso: Aproveite o que voc&#xEA; tem. Aproveite o agora (que voc&#xEA;, provavelmente, ainda pode usar os joelhos). N&#xE3;o deixe para amanh&#xE3;. Viva a vida a cada minuto da melhor maneira. &#xD;&#xD;:)</richText>
  </textBox>
</content>
